_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ГрафикДвиженийПоДоговору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_ГрафикДвиженийПоДоговору</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыСКлиентами</xr:Item>
				<xr:Item>AccumulationRegister.УСОERP_ГрафикДвиженийПоДоговору</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКлиентамиПоДокументам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_РасширенныйГрафикДвижений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_ВведенПодчиненныйГрафик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикДвиженияПоДоговору</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСобытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыКлиентом</v8:Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДвиженияДоходРасход</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ПорядокДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_ВидыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаАванс</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАванс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПриемРабот</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПриемРабот</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОстатокПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОстатокПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУдержаниеОстатокПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИтогоОстатокПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВозвратГарантийногоУдержания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозвратГарантийногоУдержания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДДС_Аванс</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыКлиентом</v8:Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДДС_ПризнаниеДоходаРасхода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ПорядокДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДДС_ОстатокПлатежа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыКлиентом</v8:Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДДС_ВозвратГарантийногоУдержания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыКлиентом</v8:Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сторно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета_Аванс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета_ПризнаниеДоходаРасхода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета_ОстатокПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета_ВозвратГарантийногоУдержания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/АналитикаУчетаПоПартнерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>АналитикаУчетаПоПартнерам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Импорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВвозИзЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СДавальцем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПереработчиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоклажедателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СХранителем</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ПорядокДоходовРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ПорядокДоходовРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеЗатрат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ГрафикДвиженийПоДоговору/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстыЗапроса.Добавить(ТекстЗапроса_ГрафикДвиженийПоДоговору(ДокументСсылка), "ГрафикДвиженийПоДоговору");
	ТекстыЗапроса.Добавить(ТекстЗапроса_РегистрНакопленияРасчеты(ДокументСсылка), "РегистрНакопленияРасчеты");
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам",		РегистрыСведений.АналитикаУчетаПоПартнерам.ЗначениеКлючаАналитики(ДокументСсылка));
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 				ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 				ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Планирование_ЗаказКлиента", 		Перечисления.ХозяйственныеОперации.ПланированиеПоЗаказуКлиента);
	Запрос.УстановитьПараметр("Планирование_ЗаказПоставщику",	Перечисления.ХозяйственныеОперации.ПланированиеПоЗаказуПоставщику);
	Запрос.УстановитьПараметр("Ссылка", 						ДокументСсылка);
	Запрос.УстановитьПараметр("Договор", 						ДокументСсылка.Договор);
	
	Запрос.Текст = "";
	Для Каждого ТекстЗапроса Из ТекстыЗапроса Цикл
		Запрос.Текст = Запрос.Текст + ТекстЗапроса.Значение;
	КонецЦикла;
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаГрафикДвиженийПоДоговору", Результат[1].Выгрузить());
	
	Если Результат.Количество() >= 3 Тогда
		ДанныеГрафика = Результат[2].Выгрузить();
		
		Если ДанныеГрафика.Колонки.Найти("ЗаказКлиента") <> Неопределено Тогда
			ДанныеГрафика.Свернуть("ВидДвижения, Период, АналитикаУчетаПоПартнерам, ЗаказКлиента, Валюта, ВалютаДокумента, ХозяйственнаяОперация, ДатаРегистратора, НомерРегистратора, ДатаПлатежа", "КОплате, КОтгрузке");
			
		ИначеЕсли ДанныеГрафика.Колонки.Найти("ЗаказПоставщику") <> Неопределено Тогда
			ДанныеГрафика.Свернуть("ВидДвижения, Период, АналитикаУчетаПоПартнерам, ЗаказПоставщику, Валюта, ВалютаДокумента, ХозяйственнаяОперация, ДатаРегистратора, НомерРегистратора, ДатаПлатежа", "КОплате, КПоступлению");
		КонецЕсли;
		
		Если ДокументСсылка.Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком 
				Или ДокументСсылка.Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком Тогда
			ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщиками", ДанныеГрафика);
			ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСКлиентами",    Новый ТаблицаЗначений);
			
		Иначе
			ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСКлиентами",    ДанныеГрафика);
			ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщиками", Новый ТаблицаЗначений);
		КонецЕсли;
		
	Иначе
		ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщиками", Новый ТаблицаЗначений);
		ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСКлиентами",    Новый ТаблицаЗначений);
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапроса_ГрафикДвиженийПоДоговору(ДокументСсылка)
	
	Если ДокументСсылка.УСОERP_РасширенныйГрафикДвижений Тогда
		
		ТекстЗапроса = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	УСОERP_ДополнительныеПараметрыПоДоговору.Ссылка КАК ДополнительныеПараметрыПоДоговору
			|ПОМЕСТИТЬ ДопПараметрыПоДоговору
			|ИЗ
			|	Документ.УСОERP_ДополнительныеПараметрыПоДоговору КАК УСОERP_ДополнительныеПараметрыПоДоговору
			|ГДЕ
			|	УСОERP_ДополнительныеПараметрыПоДоговору.Договор = &Договор
			|	И НЕ УСОERP_ДополнительныеПараметрыПоДоговору.ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	УСОERP_ДополнительныеПараметрыПоДоговору.Дата УБЫВ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	&ВидДвиженияПриход КАК ВидДвижения,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаАванс КАК Период,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка КАК Регистратор,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Организация КАК Организация,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Партнер КАК Партнер,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Контрагент КАК Контрагент,
			|	ДоговорыКонтрагентов.Ссылка КАК Договор,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаАванс КАК ДатаСобытияПоДоговору,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДДС_Аванс КАК ПорядокОплаты,
			|	ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПустаяСсылка) КАК ПорядокДоходовРасходов,
			|	ВЫБОР
			|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоВидамРабот
			|			ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидРабот
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.ПустаяСсылка)
			|	КОНЕЦ КАК ВидРабот,
			|	ВЫБОР
			|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоРаботам
			|			ТОГДА ВЫБОР
			|					КОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
			|						ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа
			|					ИНАЧЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник
			|				КОНЕЦ
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
			|	КОНЕЦ КАК Работа,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ОбъектСтроительства КАК ОбъектСтроительства,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СуммаАванс КАК ФинансированиеПлан,
			|	0 КАК ФинансированиеФакт,
			|	0 КАК ПорядокДоходовРасходовПлан,
			|	0 КАК ПорядокДоходовРасходовФакт,
			|	ДоговорыКонтрагентов.Ссылка.СтатьяДвиженияДенежныхСредств КАК СсылкаСтатьяДвиженияДенежныхСредств,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СтатьяБюджета_Аванс КАК СтатьяБюджета,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Дата КАК Дата
			|ИЗ
			|	Документ.УСОERP_ГрафикДвиженийПоДоговору.ГрафикДвиженияПоДоговору КАК УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ПО УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка,
			|	ДопПараметрыПоДоговору КАК ДопПараметрыПоДоговору
			|ГДЕ
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка = &Ссылка
			|	И УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаАванс <> ДАТАВРЕМЯ(1, 1, 1)
			|	И НЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ПометкаУдаления
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ВидДвиженияПриход,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаОстатокПлатежа,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Организация,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Партнер,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Контрагент,
			|	ДоговорыКонтрагентов.Ссылка,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаОстатокПлатежа,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДДС_ОстатокПлатежа,
			|	ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПустаяСсылка),
			|	ВЫБОР
			|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоВидамРабот
			|			ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидРабот
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.ПустаяСсылка)
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоРаботам
			|			ТОГДА ВЫБОР
			|					КОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
			|						ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа
			|					ИНАЧЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник
			|				КОНЕЦ
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
			|	КОНЕЦ,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ОбъектСтроительства,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СуммаОстатокПлатежа,
			|	0,
			|	0,
			|	0,
			|	ДоговорыКонтрагентов.Ссылка.СтатьяДвиженияДенежныхСредств,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СтатьяБюджета_ОстатокПлатежа,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Дата
			|ИЗ
			|	Документ.УСОERP_ГрафикДвиженийПоДоговору.ГрафикДвиженияПоДоговору КАК УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ПО УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка,
			|	ДопПараметрыПоДоговору КАК ДопПараметрыПоДоговору
			|ГДЕ
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка = &Ссылка
			|	И УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаОстатокПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
			|	И НЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ПометкаУдаления
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ВидДвиженияПриход,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаВозвратГарантийногоУдержания,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Организация,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Партнер,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Контрагент,
			|	ДоговорыКонтрагентов.Ссылка,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаВозвратГарантийногоУдержания,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДДС_ВозвратГарантийногоУдержания,
			|	ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПустаяСсылка),
			|	ВЫБОР
			|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоВидамРабот
			|			ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидРабот
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.ПустаяСсылка)
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоРаботам
			|			ТОГДА ВЫБОР
			|					КОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
			|						ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа
			|					ИНАЧЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник
			|				КОНЕЦ
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
			|	КОНЕЦ,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ОбъектСтроительства,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СуммаВозвратГарантийногоУдержания,
			|	0,
			|	0,
			|	0,
			|	ДоговорыКонтрагентов.Ссылка.СтатьяДвиженияДенежныхСредств,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СтатьяБюджета_ВозвратГарантийногоУдержания,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Дата
			|ИЗ
			|	Документ.УСОERP_ГрафикДвиженийПоДоговору.ГрафикДвиженияПоДоговору КАК УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ПО УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка,
			|	ДопПараметрыПоДоговору КАК ДопПараметрыПоДоговору
			|ГДЕ
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка = &Ссылка
			|	И УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаВозвратГарантийногоУдержания <> ДАТАВРЕМЯ(1, 1, 1)
			|	И НЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ПометкаУдаления
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ВидДвиженияПриход,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаПриемРабот,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Организация,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Партнер,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Контрагент,
			|	ДоговорыКонтрагентов.Ссылка,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаПриемРабот,
			|	ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.ПустаяСсылка),
			|	ВЫБОР
			|		КОГДА ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПоставщиком)
			|				ИЛИ ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПереработчиком)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПоступлениеЗатрат)
			|		КОГДА ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
			|				ИЛИ ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СДавальцем)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.Реализация)
			|		ИНАЧЕ NULL
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоВидамРабот
			|			ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидРабот
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.ПустаяСсылка)
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоРаботам
			|			ТОГДА ВЫБОР
			|					КОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
			|						ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа
			|					ИНАЧЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник
			|				КОНЕЦ
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
			|	КОНЕЦ,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ОбъектСтроительства,
			|	0,
			|	0,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СуммаПриемРабот,
			|	0,
			|	ДоговорыКонтрагентов.Ссылка.СтатьяДвиженияДенежныхСредств,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СтатьяБюджета_ПризнаниеДоходаРасхода,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Дата
			|ИЗ
			|	Документ.УСОERP_ГрафикДвиженийПоДоговору.ГрафикДвиженияПоДоговору КАК УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ПО УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка,
			|	ДопПараметрыПоДоговору КАК ДопПараметрыПоДоговору
			|ГДЕ
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка = &Ссылка
			|	И УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаПриемРабот <> ДАТАВРЕМЯ(1, 1, 1)
			|	И НЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаСобытияПоДоговору
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|";

		
	Иначе
		
		ТекстЗапроса = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	УСОERP_ДополнительныеПараметрыПоДоговору.Ссылка КАК ДополнительныеПараметрыПоДоговору
			|ПОМЕСТИТЬ ДопПараметрыПоДоговору
			|ИЗ
			|	Документ.УСОERP_ДополнительныеПараметрыПоДоговору КАК УСОERP_ДополнительныеПараметрыПоДоговору
			|ГДЕ
			|	УСОERP_ДополнительныеПараметрыПоДоговору.Договор = &Договор
			|	И НЕ УСОERP_ДополнительныеПараметрыПоДоговору.ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	УСОERP_ДополнительныеПараметрыПоДоговору.Дата УБЫВ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	&ВидДвиженияПриход КАК ВидДвижения,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаСобытия КАК Период,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка КАК Регистратор,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Организация КАК Организация,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Партнер КАК Партнер,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Контрагент КАК Контрагент,
			|	ДоговорыКонтрагентов.Ссылка КАК Договор,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаСобытия КАК ДатаСобытияПоДоговору,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДвиженияДенежныхСредств КАК ПорядокОплаты,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДвиженияДоходРасход КАК ПорядокДоходовРасходов,
			|	ВЫБОР
			|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоВидамРабот
			|			ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидРабот
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.ПустаяСсылка)
			|	КОНЕЦ КАК ВидРабот,
			|	ВЫБОР
			|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоРаботам
			|			ТОГДА ВЫБОР
			|					КОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
			|						ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа
			|					ИНАЧЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник
			|				КОНЕЦ
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
			|	КОНЕЦ КАК Работа,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ОбъектСтроительства КАК ОбъектСтроительства,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ОбщаяСумма КАК ФинансированиеПлан,
			|	0 КАК ФинансированиеФакт,
			|	0 КАК ПорядокДоходовРасходовПлан,
			|	0 КАК ПорядокДоходовРасходовФакт,
			|	ДоговорыКонтрагентов.Ссылка.СтатьяДвиженияДенежныхСредств КАК СсылкаСтатьяДвиженияДенежныхСредств,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СтатьяБюджета КАК СтатьяБюджета,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Дата КАК Дата
			|ИЗ
			|	Документ.УСОERP_ГрафикДвиженийПоДоговору.ГрафикДвиженияПоДоговору КАК УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ПО УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка,
			|	ДопПараметрыПоДоговору КАК ДопПараметрыПоДоговору
			|ГДЕ
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка = &Ссылка
			|	И (УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДвиженияДенежныхСредств ССЫЛКА Перечисление.ВариантыОплатыКлиентом
			|				И УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДвиженияДенежныхСредств <> ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.ПустаяСсылка)
			|			ИЛИ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДвиженияДенежныхСредств ССЫЛКА Перечисление.ВариантыОплатыПоставщику
			|				И УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДвиженияДенежныхСредств <> ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.ПустаяСсылка))
			|	И НЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ПометкаУдаления
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ВидДвиженияПриход,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаСобытия,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Организация,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Партнер,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Контрагент,
			|	ДоговорыКонтрагентов.Ссылка,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаСобытия,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДвиженияДенежныхСредств,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДвиженияДоходРасход,
			|	ВЫБОР
			|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоВидамРабот
			|			ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидРабот
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.ПустаяСсылка)
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоРаботам
			|			ТОГДА ВЫБОР
			|					КОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
			|						ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа
			|					ИНАЧЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник
			|				КОНЕЦ
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
			|	КОНЕЦ,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ОбъектСтроительства,
			|	0,
			|	0,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ОбщаяСумма,
			|	0,
			|	ДоговорыКонтрагентов.Ссылка.СтатьяДвиженияДенежныхСредств,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СтатьяБюджета,
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Дата
			|ИЗ
			|	Документ.УСОERP_ГрафикДвиженийПоДоговору.ГрафикДвиженияПоДоговору КАК УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ПО УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка,
			|	ДопПараметрыПоДоговору КАК ДопПараметрыПоДоговору
			|ГДЕ
			|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка = &Ссылка
			|	И УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДвиженияДоходРасход ССЫЛКА Перечисление.УСОERP_ПорядокДоходовРасходов
			|	И УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДвиженияДоходРасход <> ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПустаяСсылка)
			|	И НЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаСобытияПоДоговору
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|";

			
		КонецЕсли;
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса_РегистрНакопленияРасчеты(ДокументСсылка)
	
	Если ДокументСсылка.Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком 
		ИЛИ ДокументСсылка.Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком Тогда
		
		Если ДокументСсылка.УСОERP_РасширенныйГрафикДвижений Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	&ВидДвиженияРасход КАК ВидДвижения,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаАванс КАК Период,
			|	&АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка КАК ЗаказПоставщику,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов КАК Валюта,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов КАК ВалютаДокумента,
			|	ТЧ_ГрафикДвиженийПоДоговору.СуммаАванс КАК КОплате,
			|	0 КАК КПоступлению,
			|	&Планирование_ЗаказПоставщику КАК ХозяйственнаяОперация,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Дата КАК ДатаРегистратора,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Номер КАК НомерРегистратора,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаАванс КАК ДатаПлатежа
			|ИЗ
			|	Документ.УСОERP_ГрафикДвиженийПоДоговору.ГрафикДвиженияПоДоговору КАК ТЧ_ГрафикДвиженийПоДоговору
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ПО ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
			|ГДЕ
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка = &Ссылка
			|	И ТЧ_ГрафикДвиженийПоДоговору.ДатаАванс <> ДАТАВРЕМЯ(1, 1, 1)
			|	И ТЧ_ГрафикДвиженийПоДоговору.СуммаАванс > 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ВидДвиженияРасход,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаПриемРабот,
			|	&АналитикаУчетаПоПартнерам,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
			|	0,
			|	ТЧ_ГрафикДвиженийПоДоговору.СуммаПриемРабот,
			|	&Планирование_ЗаказПоставщику,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Дата,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Номер,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаПриемРабот
			|ИЗ
			|	Документ.УСОERP_ГрафикДвиженийПоДоговору.ГрафикДвиженияПоДоговору КАК ТЧ_ГрафикДвиженийПоДоговору
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ПО ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
			|ГДЕ
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка = &Ссылка
			|	И ТЧ_ГрафикДвиженийПоДоговору.ДатаПриемРабот <> ДАТАВРЕМЯ(1, 1, 1)
			|	И ТЧ_ГрафикДвиженийПоДоговору.СуммаПриемРабот > 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ВидДвиженияРасход,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаОстатокПлатежа,
			|	&АналитикаУчетаПоПартнерам,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
			|	ТЧ_ГрафикДвиженийПоДоговору.СуммаОстатокПлатежа,
			|	0,
			|	&Планирование_ЗаказПоставщику,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Дата,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Номер,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаОстатокПлатежа
			|ИЗ
			|	Документ.УСОERP_ГрафикДвиженийПоДоговору.ГрафикДвиженияПоДоговору КАК ТЧ_ГрафикДвиженийПоДоговору
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ПО ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
			|ГДЕ
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка = &Ссылка
			|	И ТЧ_ГрафикДвиженийПоДоговору.ДатаОстатокПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
			|	И ТЧ_ГрафикДвиженийПоДоговору.СуммаОстатокПлатежа > 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ВидДвиженияРасход,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаВозвратГарантийногоУдержания,
			|	&АналитикаУчетаПоПартнерам,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
			|	ТЧ_ГрафикДвиженийПоДоговору.СуммаВозвратГарантийногоУдержания,
			|	0,
			|	&Планирование_ЗаказПоставщику,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Дата,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Номер,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаВозвратГарантийногоУдержания
			|ИЗ
			|	Документ.УСОERP_ГрафикДвиженийПоДоговору.ГрафикДвиженияПоДоговору КАК ТЧ_ГрафикДвиженийПоДоговору
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ПО ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
			|ГДЕ
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка = &Ссылка
			|	И ТЧ_ГрафикДвиженийПоДоговору.ДатаВозвратГарантийногоУдержания <> ДАТАВРЕМЯ(1, 1, 1)
			|	И ТЧ_ГрафикДвиженийПоДоговору.СуммаВозвратГарантийногоУдержания > 0
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|";
			
		Иначе
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	&ВидДвиженияРасход КАК ВидДвижения,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаСобытия КАК Период,
			|	&АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка КАК ЗаказПоставщику,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов КАК Валюта,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов КАК ВалютаДокумента,
			|	СУММА(ВЫБОР
			|			КОГДА ТЧ_ГрафикДвиженийПоДоговору.ВидДвиженияДоходРасход = ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПустаяСсылка)
			|				ТОГДА ТЧ_ГрафикДвиженийПоДоговору.ОбщаяСумма
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК КОплате,
			|	СУММА(ВЫБОР
			|			КОГДА ТЧ_ГрафикДвиженийПоДоговору.ВидДвиженияДоходРасход <> ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПустаяСсылка)
			|				ТОГДА ТЧ_ГрафикДвиженийПоДоговору.ОбщаяСумма
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК КПоступлению,
			|	&Планирование_ЗаказПоставщику КАК ХозяйственнаяОперация,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Дата КАК ДатаРегистратора,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Номер КАК НомерРегистратора,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаСобытия КАК ДатаПлатежа
			|ИЗ
			|	Документ.УСОERP_ГрафикДвиженийПоДоговору.ГрафикДвиженияПоДоговору КАК ТЧ_ГрафикДвиженийПоДоговору
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ПО ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
			|ГДЕ
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаСобытия,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Дата,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Номер,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаСобытия
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|";
			
		КонецЕсли;
		
	ИначеЕсли ДокументСсылка.Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем 
		ИЛИ ДокументСсылка.Договор.ТипДоговора = Перечисления.ТипыДоговоров.СДавальцем Тогда
		
		Если ДокументСсылка.УСОERP_РасширенныйГрафикДвижений Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	&ВидДвиженияПриход КАК ВидДвижения,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаАванс КАК Период,
			|	&АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка КАК ЗаказКлиента,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов КАК Валюта,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов КАК ВалютаДокумента,
			|	ТЧ_ГрафикДвиженийПоДоговору.СуммаАванс КАК КОплате,
			|	0 КАК КОтгрузке,
			|	&Планирование_ЗаказКлиента КАК ХозяйственнаяОперация,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Дата КАК ДатаРегистратора,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Номер КАК НомерРегистратора,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаАванс КАК ДатаПлатежа
			|ИЗ
			|	Документ.УСОERP_ГрафикДвиженийПоДоговору.ГрафикДвиженияПоДоговору КАК ТЧ_ГрафикДвиженийПоДоговору
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ПО ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
			|ГДЕ
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка = &Ссылка
			|	И ТЧ_ГрафикДвиженийПоДоговору.ДатаАванс <> ДАТАВРЕМЯ(1, 1, 1)
			|	И ТЧ_ГрафикДвиженийПоДоговору.СуммаАванс > 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ВидДвиженияПриход,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаПриемРабот,
			|	&АналитикаУчетаПоПартнерам,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
			|	0,
			|	ТЧ_ГрафикДвиженийПоДоговору.СуммаПриемРабот,
			|	&Планирование_ЗаказКлиента,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Дата,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Номер,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаПриемРабот
			|ИЗ
			|	Документ.УСОERP_ГрафикДвиженийПоДоговору.ГрафикДвиженияПоДоговору КАК ТЧ_ГрафикДвиженийПоДоговору
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ПО ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
			|ГДЕ
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка = &Ссылка
			|	И ТЧ_ГрафикДвиженийПоДоговору.ДатаПриемРабот <> ДАТАВРЕМЯ(1, 1, 1)
			|	И ТЧ_ГрафикДвиженийПоДоговору.СуммаПриемРабот > 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ВидДвиженияПриход,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаОстатокПлатежа,
			|	&АналитикаУчетаПоПартнерам,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
			|	ТЧ_ГрафикДвиженийПоДоговору.СуммаОстатокПлатежа,
			|	0,
			|	&Планирование_ЗаказКлиента,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Дата,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Номер,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаОстатокПлатежа
			|ИЗ
			|	Документ.УСОERP_ГрафикДвиженийПоДоговору.ГрафикДвиженияПоДоговору КАК ТЧ_ГрафикДвиженийПоДоговору
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ПО ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
			|ГДЕ
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка = &Ссылка
			|	И ТЧ_ГрафикДвиженийПоДоговору.ДатаОстатокПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
			|	И ТЧ_ГрафикДвиженийПоДоговору.СуммаОстатокПлатежа > 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ВидДвиженияПриход,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаВозвратГарантийногоУдержания,
			|	&АналитикаУчетаПоПартнерам,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
			|	ТЧ_ГрафикДвиженийПоДоговору.СуммаВозвратГарантийногоУдержания,
			|	0,
			|	&Планирование_ЗаказКлиента,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Дата,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Номер,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаВозвратГарантийногоУдержания
			|ИЗ
			|	Документ.УСОERP_ГрафикДвиженийПоДоговору.ГрафикДвиженияПоДоговору КАК ТЧ_ГрафикДвиженийПоДоговору
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ПО ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
			|ГДЕ
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка = &Ссылка
			|	И ТЧ_ГрафикДвиженийПоДоговору.ДатаВозвратГарантийногоУдержания <> ДАТАВРЕМЯ(1, 1, 1)
			|	И ТЧ_ГрафикДвиженийПоДоговору.СуммаВозвратГарантийногоУдержания > 0
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|";
			
		Иначе
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	&ВидДвиженияПриход КАК ВидДвижения,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаСобытия КАК Период,
			|	&АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка КАК ЗаказКлиента,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов КАК Валюта,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов КАК ВалютаДокумента,
			|	СУММА(ВЫБОР
			|			КОГДА ТЧ_ГрафикДвиженийПоДоговору.ВидДвиженияДоходРасход = ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПустаяСсылка)
			|				ТОГДА ТЧ_ГрафикДвиженийПоДоговору.ОбщаяСумма
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК КОплате,
			|	СУММА(ВЫБОР
			|			КОГДА ТЧ_ГрафикДвиженийПоДоговору.ВидДвиженияДоходРасход <> ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПустаяСсылка)
			|				ТОГДА ТЧ_ГрафикДвиженийПоДоговору.ОбщаяСумма
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК КОтгрузке,
			|	&Планирование_ЗаказКлиента КАК ХозяйственнаяОперация,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Дата КАК ДатаРегистратора,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Номер КАК НомерРегистратора,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаСобытия КАК ДатаПлатежа
			|ИЗ
			|	Документ.УСОERP_ГрафикДвиженийПоДоговору.ГрафикДвиженияПоДоговору КАК ТЧ_ГрафикДвиженийПоДоговору
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ПО ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
			|ГДЕ
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаСобытия,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Дата,
			|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Номер,
			|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
			|	ТЧ_ГрафикДвиженийПоДоговору.ДатаСобытия
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Отчеты
// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
